<a href="https://colab.research.google.com/github/ian293382/Python_Pandas_Numpy/blob/main/PandasDemon.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install pandas

import pandas as pd

s = pd.Series([1,3,5,7,9])

print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [4]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 32, 18, 47],
    'city': ['New York', 'Paris', 'London', 'Berlin']
}

df = pd.DataFrame(data)

print(df)

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin

In [6]:
print(df[['name', 'city']])

      name      city
0    Alice  New York
1      Bob     Paris
2  Charlie    London
3    David    Berlin

In [7]:
print(df[0:3])

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London

In [11]:
df1 = pd.DataFrame(data)

df1.set_index('name', inplace=True)

result = df1.loc[['Alice', 'Charlie'], ['age', 'city']]

print(result)

         age      city
name
Alice     25  New York
Charlie   18    London

In [12]:
print (df.sort_index())

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin

In [15]:
data2 = {
    'name': ['Eva', 'Frank', 'Grace', 'Henry'],
    'age': [29,23,37,31],
    'city': ['Rome', 'Sydney', 'Tokyo', 'Moscow']
}

df2 = pd.DataFrame(data2)

print(pd.concat([df, df2], axis=0))

print(pd.concat([df, df2], axis=1))

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin
0      Eva   29      Rome
1    Frank   23    Sydney
2    Grace   37     Tokyo
3    Henry   31    Moscow
      name  age      city   name  age    city
0    Alice   25  New York    Eva   29    Rome
1      Bob   32     Paris  Frank   23  Sydney
2  Charlie   18    London  Grace   37   Tokyo
3    David   47    Berlin  Henry   31  Moscow

In [25]:
data1 ={
    'name':['Alice', 'Bob', 'Chalie', 'David'],
    'salary': [5000, 6000, 7000, 8000]
}

df1 = pd.DataFrame(data1)

print(pd.merge(df, df1, on='name'))

data3 = {
    'salary': [5000,6000, 7000, 8000]
}

df3 = pd.DataFrame(data3)
print(df.join(df3))

    name  age      city  salary
0  Alice   25  New York    5000
1    Bob   32     Paris    6000
2  David   47    Berlin    8000
      name  age      city  salary
0    Alice   25  New York    5000
1      Bob   32     Paris    6000
2  Charlie   18    London    7000
3    David   47    Berlin    8000